ying-css/aws_trustm_dps_co2/projects/cypress/CY8CPROTO_062_4343W/mtb/aws_demos/vendors/cypress/secure_elements/optiga_trust_m/optiga/comms/ifx_i2c/ifx_i2c_presentation_layer.c
/**
* \copyright
* MIT License
*
* Copyright (c) 2020 Infineon Technologies AG
*
* Permission is hereby granted, free of charge, to any person obtaining a copy
* of this software and associated documentation files (the "Software"), to deal
* in the Software without restriction, including without limitation the rights
* to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
* copies of the Software, and to permit persons to whom the Software is
* furnished to do so, subject to the following conditions:
*
* The above copyright notice and this permission notice shall be included in all
* copies or substantial portions of the Software.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
* IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
* AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
* LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
* OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
* SOFTWARE
*
* \endcopyright
*
* \author Infineon Technologies AG
*
* \file ifx_i2c_presentation_layer.c
*
* \brief   This file implements the IFX I2C Presentation Layer of the Infineon I2C Protocol Stack library.
*
* \ingroup  grIFXI2C
*
* @{
*/

#include "optiga/ifx_i2c/ifx_i2c_presentation_layer.h"
#include "optiga/ifx_i2c/ifx_i2c_transport_layer.h"
#include "optiga/pal/pal_crypt.h"
#include "optiga/common/optiga_lib_common.h"
#include "optiga/pal/pal_ifx_i2c_config.h"
// include lower layer header
/// @cond hidden

// Setup debug log statements
#if IFX_I2C_LOG_PRL == 1
#define LOG_PRL IFX_I2C_LOG
#else
#define LOG_PRL(...)  //printf(__VA_ARGS__);
#endif

#ifdef OPTIGA_COMMS_SHIELDED_CONNECTION        

/// @cond hidden

// Presentation Layer states
#define PRL_STATE_UNINIT                     (0x00)
#define PRL_STATE_IDLE                       (0x01)
#define PRL_STATE_START                      (0x02)
#define PRL_STATE_VERIFY                     (0x03)
#define PRL_STATE_TXRX                       (0x04)
#define PRL_STATE_HANDSHAKE                  (0x05)
#define PRL_STATE_ALERT                      (0x06)
#define PRL_STATE_ERROR                      (0x07)
#define PRL_STATE_MANAGE_CONTEXT             (0x08)

///Manage context state
#define PRL_MANAGE_CONTEXT_TX_STATE          (0x01)
#define PRL_MANAGE_CONTEXT_RX_STATE          (0x02)

/// Handshake status
#define PRL_HS_SEND_HELLO                    (0x11)
#define PRL_HS_VERIFY_HELLO                  (0x22)
#define PRL_HS_SEND_FINISHED                 (0x33)
#define PRL_HS_VERIFY_FINISHED               (0x44)
#define PRL_HS_ERROR                         (0x55)

/// Handshake type
#define PRL_MASTER_HELLO_MSG                 (0x00)
#define PRL_MASTER_FINISHED_MSG              (0x08)

///Protocol type
#define PRL_HANDSHAKE_PROTOCOL               (0x00)
#define PRL_RECORD_EXCHANGE_PROTOCOL         (0x20)
#define PRL_ALERT_PROTOCOL                   (0x40)

///Message type
#define PRL_FATAL_ALERT_MSG                  (0x00)
#define PRL_INTEGRITY_VIOLATED_ALERT_MSG     (0x04)
#define PRL_INVALID_ALERT                    (0xFF)
#define PRL_DEFAULT_ALERT                    (0x11)

///Handshake completion state
#define PRL_NEGOTIATION_NOT_DONE             (0x00)
#define PRL_NEGOTIATION_DONE                 (0x01)

///Offset calculation values
#define PRL_MASTER_ENCRYPTION_KEY_OFFSET     (0x00)
#define PRL_MASTER_ENCRYPTION_NONCE_OFFSET   (0x20)
#define PRL_MASTER_DECRYPTION_KEY_OFFSET     (0x10)
#define PRL_MASTER_DECRYPTION_NONCE_OFFSET   (0x24)
#define PRL_SLAVE_HELLO_SEQ_NUMBER_OFFSET    (0x22)
#define PRL_PLAIN_TEST_OFFSET                (0x04)
#define PRL_SCTR_OFFSET                      (0x00)
#define PRL_PROTOCOL_VERSION_OFFSET          (0x01)
#define PRL_RANDOM_DATAOFFSET                (0x02)

///Length calculation values
#define PRL_RANDOM_DATA_LENGTH               (0x20)
#define PRL_MASTER_NONCE_LENGTH              (0x04)
#define PRL_FINISHED_DATA_LENGTH             (0x30)
#define PRL_SEQ_NUMBER_LENGTH                (0x04)
#define PRL_SLAVE_HELLO_LENGTH               (0x26)
#define PRL_NONCE_LENGTH                     (0x08)

///Manage context message type
#define PRL_SAVE_CONTEXT_MSG                 (0x60)
#define PRL_CONTEXT_SAVED_MSG                (0x64)
#define PRL_RESTORE_CONTEXT_MSG              (0x68)
#define PRL_CONTEXT_RESTORED_MSG             (0x6C)

///Restore operation state
#define PRL_RESTORE_NOT_DONE                 (0x00)
#define PRL_RESTORE_DONE                     (0x01)

///Mask values
#define PRL_MANAGE_CONTEXT_MASK              (0xFC)
#define PRL_PROTECTION_MASK                  (0x03)

#define PRL_SEQUENCE_THRESHOLD               (0xFFFFFFF0)
#define PRL_TRANS_REPEAT                     (DL_TRANS_REPEAT)

#define PRL_LABEL                            "Platform Binding"

#define FORM_SCTR_HEADER(ctx, protocol, msg, protection){\
                         p_ctx->prl.sctr = (protocol | msg | protection);}\

#define ERROR_STATE_PREPARATION(ctx, exit_machine){\
                                ctx->prl.alert_type = PRL_INVALID_ALERT;\
                                ctx->prl.state = PRL_STATE_ERROR;\
                                ctx->prl.negotiation_state = PRL_NEGOTIATION_NOT_DONE;\
                                ctx->prl.return_status = IFX_I2C_SESSION_ERROR;\
                                ctx->prl.trans_repeat_status = FALSE;\
                                exit_machine = TRUE;}\

#define CLEAR_SESSION_CONTEXT(ctx){\
                              memset(ctx->prl.session_key,0,sizeof(ctx->prl.session_key));\
                              ctx->prl.master_sequence_number = 0;\
                              ctx->prl.slave_sequence_number = 0;\
                              ctx->prl.save_slave_sequence_number = 0;\
                              ctx->prl.decryption_failure_counter = 0;\
                              ctx->prl.data_retransmit_counter = 0;\
                              ctx->prl.trans_repeat_status = FALSE;\
                              ctx->prl.state = PRL_STATE_IDLE;}\

